# coding=utf-8
from enum import Enum, auto


class 领养阶段类(Enum):
    首次执行 = auto()
    已查看组合 = auto()
    已查看宝可梦信息 = auto()


class 缓存类型类(Enum):
    领养宝可梦 = auto()
    删除队伍 = auto()


class 表名类(Enum):
    激活效果表 = "激活效果表"
    排行榜表 = "排行榜表"
    招式表 = "招式表"
    宝可梦表 = "宝可梦表"
    队伍信息表 = "队伍信息表"
    队伍成员表 = "队伍成员表"
    用户表 = "用户表"
    用户物品表 = "用户物品表"


class 操作类(Enum):
    插入 = "插入"
    更新 = "更新"
    删除 = "删除"
    更新或写入 = "更新或写入"


class 效果类型类(Enum):
    即时捕获 = "即时捕获"
    修改宝可梦出现概率 = "修改宝可梦出现概率"
    先行攻击 = "先行攻击"
    奖励加成 = "奖励加成"
    添加限时状态 = "添加限时状态"
    心情恢复 = "心情恢复"
    增加队伍上限 = "增加队伍上限"
    全队等级提升 = "全队等级提升"
    开启极巨化 = "开启极巨化"
    开启Mega进化 = "开启Mega进化"
    进化 = "进化"
    无 = "无"
